{
  "_name_or_path": "aubmindlab/bert-base-arabertv2",
  "architectures": ["BertForSequenceClassification"],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "carburant", "1": "climatisation", "2": "direction",
    "3": "échappement", "4": "électricité", "5": "freinage",
    "6": "moteur", "7": "refroidissement", "8": "suspension",
    "9": "transmission"
  },
  "label2id": {
    "carburant": 0, "climatisation": 1, "direction": 2,
    "échappement": 3, "électricité": 4, "freinage": 5,
    "moteur": 6, "refroidissement": 7, "suspension": 8,
    "transmission": 9
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "num_labels": 10,
  "pad_token_id": 0,
  "task": "automotive_fault_classification",
  "project": "DiagCar AI - DZ Nova",
  "note": "AraBERT config prepared for future fine-tuning. Current production model uses TF-IDF+SVM (97.1% accuracy). BERT integration planned as future improvement.",
  "vocab_size": 64000
}
